import numpy as np


####################仅仅是一个示例###################################


# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        self.cam_matrix_left = np.array([[1.4159e+3, 0, 384.5511],
                                        [0, 1.41760e+3, 218.2406],
                                                               [0., 0., 1.]])        
        self.cam_matrix_right = np.array([[1.4168e+3, 0, 376.0314],
                                         [0, 1.4173e+3, 232.377],
                                                              [0., 0., 1.]])


        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[0.0228, 0.0679, 0,0.0, 0]])
        self.distortion_r = np.array([[0.0125, 0.0536, -0.00 ,  0.000,0 ]])

        # 旋转矩阵
        self.R =  np.array([[0.9999, -0.0113, 1.782e-4],
                            [0.0113, 0.9997, 0.0196],
                            [-3.9896e-4, -00.0196, 0.9998]]).T

        # 平移矩阵
        self.T = np.array([[-142.9578], [0.2815], [0.2276]])

        # 焦距
        self.focal_length = 1544.5734018116168 # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3] # TODO

        # 基线距离
        self.baseline = 700.1814 # 单位：mm， 为平移向量的第一个参数（取绝对值）

       


